**Цель домашнего задания**

Отработать навык работы с оконными функциями на транзакционных данных.

 

**Условия**

Дано 2 csv-файла: один с транзакциями за период 01.01.2023 - 20.04.2023, второй с информацией о клиентах.

**За дефолтную дату для выборки действующих клиентов брать ‘2023-05-01’**

Необходимо в Jupyter-ноутбуке выполнить следующие пункты, используя SQLite:

**Шаг 1. Подготовительный этап**

*Аналогичные действия вы делали в прошлом домашнем задании.*

**(Балл - 2)** Необходимо скачать CSV-файл - «[transactions_for_dz2.csv](https://drive.google.com/file/d/1GsKxPQ3cp1_uuyoLoAQLlsHTLEbXOMIo/view?usp=share_link)», создать таблицу transaction_bd со всеми полями, загрузить данные из файла в таблицу и оставить таблицу со структурой:

(0, 'TRANSACTION_ID', 'INTEGER', 0, None, 0) - id транзакции

(1, 'TX_DATETIME', 'NUMERIC', 0, None, 0) - дата транзакции

(2, 'CUSTOMER_ID', 'INTEGER', 0, None, 0) - id клиента

(3, 'TERMINAL_ID', 'INTEGER', 0, None, 0) - id терминала

(4, 'TX_AMOUNT', 'REAL', 0, None, 0) - сумма транзакции

Также необходимо скачать второй CSV-файл - «[client_info.csv](https://drive.google.com/file/d/1oFzZfwHBtP0NOulBYlp4osIY5NIPIdn-/view?usp=share_link)», создать таблицу customer_bd со всеми полями, загрузить данные из файла в таблицу и получить таблицу со структурой:

(0, 'CLIENT_ID', 'INTEGER', 0, None, 0) - id клиента

(1, 'START_DT', 'NUMERIC', 0, None, 0) - дата начало записи о клиенте

(2, 'END_DT', 'NUMERIC', 0, None, 0) - дата закрытия записи о клиенте

(3, 'CLIENT_NAME', 'TEXT', 0, None, 0) - название клиента

(4, 'YEAR_BIRTH', 'TEXT', 0, None, 0) - дата рождения клиента

**Шаг 2**

**(Балл - 2 за каждый пункт)** Написать скрипты:

- a. Вывести список всех клиентов, у которых между двумя ближайшими транзакциями был перерыв больше 35 дней хотя бы один раз (клиент должен быть действующим, то есть дата закрытия записи о клиенте не должна быть меньше дня относительно которого мы считаемся).

- b. Вывести список клиентов, у которых максимальная сумма транзакции (имеется ввиду максимальное значение TX_AMOUNT) больше 50000. В ответе должен быть id клиента, максимальное значение суммы транзакций, минимальное значение суммы транзакций (клиент должен быть действующим, то есть дата закрытия записи о клиенте не должна быть меньше дня относительно которого мы считаемся).
- c. Вывести топ-10 клиентов (сортируя их по убыванию id), у которых сумма дневных транзакций больше суммы вечерних транзакций Условимся, что дневными считаются транзакции, которые были произведены до 12 часов, а вечерними - после 12 часов включительно. (клиент должен быть действующим, то есть дата закрытия записи о клиенте не должна быть меньше дня относительно которого мы считаемся).

- d. Найти для каждого клиента день, когда у него была максимальная сумма транзакции, то есть вывести клиента, дату транзакции, сумму транзакции (клиент должен быть действующим, то есть дата закрытия записи о клиенте не должна быть меньше дня относительно которого мы считаемся).

- e. Вычислить интегральное распределение суммы транзакций для каждого дня за весь период, то есть вывести дату транзакции, сумму транзакции и интегральное распределение по сумме (не учитываем что клиент может быть недействующим)
 

 

Сроки выполнения задания
До 16.04.2023, 23:59.

Импортируем библиотеки

In [1]:
import pandas as pd
import sqlite3

Создадим функции для подключения к базе данных, выполнения запросов и создании таблиц.

In [2]:
def create_connection(path):
    connection = None
    try:
        connection = sqlite3.connect(path)
        print("Connection to SQLite DB successful")
    except Error as e:
        print(f"The error '{e}' occurred")

    return connection

In [3]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query executed successfully")
    except Error as e:
        print(f"The error '{e}' occurred")

In [4]:
def sql_insert(con, entities, text_sql_insert_into_table):

    cursorObj = con.cursor()
    cursorObj.execute(text_sql_insert_into_table, entities)

## Шаг 1

Подключимся к базе данных

In [5]:
connection = create_connection('database.db')

Connection to SQLite DB successful

In [6]:
cursor = sqlite3.Cursor(connection)

Создадим таблицу transaction_bd

In [12]:
sql_create_table = '''
                        CREATE TABLE IF NOT EXISTS transaction_bd (
                                            "TRANSACTION_ID" INTEGER,
                                            "TX_DATETIME" NUMERIC,
                                            "CUSTOMER_ID" INTEGER,
                                            "TERMINAL_ID" INTEGER,
                                            "TX_AMOUNT" REAL NOT NULL
                                                        )
                     '''

In [13]:
execute_query(connection, sql_create_table)

Query executed successfully

Создадим таблицу customer_bd

In [14]:
sql_create_table = '''
                        CREATE TABLE IF NOT EXISTS customer_bd (
                                            "CLIENT_ID" INTEGER,
                                            "START_DT" NUMERIC,
                                            "END_DT" NUMERIC,
                                            "CLIENT_NAME" TEXT,
                                            "YEAR_BIRTH" TEXT
                                                        )
                     '''

In [15]:
execute_query(connection, sql_create_table)

Query executed successfully

Прочитаем данные из файлов и вставим их в таблицы

In [16]:
text_sql_insert_into_table = '''
                                 INSERT INTO transaction_bd(
                                                         TRANSACTION_ID,
                                                         TX_DATETIME,
                                                         CUSTOMER_ID,
                                                         TERMINAL_ID,
                                                         TX_AMOUNT
                                                      )
                                 VALUES(?, ?, ?, ?, ?)
                             '''

In [17]:
with open('transactions_for_dz2.csv', encoding='utf-8') as file:
    text = file.readlines()
for line in text[1:]:
    sql_insert(connection, line.split(','), text_sql_insert_into_table)
connection.commit()

In [18]:
text_sql_insert_into_table = '''
                                 INSERT INTO customer_bd(
                                                         START_DT,
                                                         END_DT,
                                                         CLIENT_NAME,
                                                         YEAR_BIRTH,
                                                         CLIENT_ID
                                                      )
                                 VALUES(?, ?, ?, ?, ?)
                             '''

In [19]:
with open('client_info.csv', encoding='utf-8') as file:
    text = file.readlines()
for line in text[1:]:
    sql_insert(connection, line.split(';'), text_sql_insert_into_table)
connection.commit()

In [4]:
customers = pd.read_csv('client_info.csv', sep=';', parse_dates=['START_DT', 'END_DT'])
customers.head(3)

    START_DT      END_DT CLIENT_NAME  YEAR_BIRTH  CLIENT_ID
0 2015-07-16  2021-01-01      Olivia        1979       2213
1 2015-07-17  2021-01-01        Emma        1979       1148
2 2015-07-18  2021-01-01   Charlotte        1979       2293

In [57]:
customers['END_DT'] = customers['END_DT'].apply(lambda x: '2261-12-31' if x == '2999-12-31' else x)

In [59]:
customers['END_DT'] = pd.to_datetime(customers['END_DT'])

In [60]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4988 entries, 0 to 4987
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DT     4988 non-null   datetime64[ns]
 1   END_DT       4988 non-null   datetime64[ns]
 2   CLIENT_NAME  4988 non-null   object
 3   YEAR_BIRTH   4988 non-null   int64
 4   CLIENT_ID    4988 non-null   int64
dtypes: datetime64[ns](2), int64(2), object(1)
memory usage: 195.0+ KB

In [66]:
customers.head(3)

    START_DT     END_DT CLIENT_NAME  YEAR_BIRTH  CLIENT_ID
0 2015-07-16 2021-01-01      Olivia        1979       2213
1 2015-07-17 2021-01-01        Emma        1979       1148
2 2015-07-18 2021-01-01   Charlotte        1979       2293

In [65]:
transaction = pd.read_csv('transactions_for_dz2.csv', parse_dates=['TX_DATETIME'])
transaction.head(3)

   TRANSACTION_ID         TX_DATETIME  CUSTOMER_ID  TERMINAL_ID  TX_AMOUNT
0               0 2023-01-01 00:00:31          596         3156     533.07
1               1 2023-01-01 00:02:10         4961         3412     808.56
2               2 2023-01-01 00:07:56            2         1365    1442.94

In [69]:
df = pd.merge(transaction, customers, left_on='CUSTOMER_ID', right_on='CLIENT_ID')
df.head(3)

,TRANSACTION_ID,TX_DATETIME,CUSTOMER_ID,TERMINAL_ID,TX_AMOUNT,START_DT,END_DT,CLIENT_NAME,YEAR_BIRTH,CLIENT_ID
0,0,2023-01-01 00:00:31,596,3156,533.07,2011-03-03,2023-03-03,Janice,1957,596
1,6440,2023-01-01 14:32:25,596,7633,558.99,2011-03-03,2023-03-03,Janice,1957,596
2,8491,2023-01-01 18:33:13,596,2440,589.15,2011-03-03,2023-03-03,Janice,1957,596

## Шаг 2
Напишем скрипты:

- a. Вывести список всех клиентов, у которых между двумя ближайшими транзакциями был перерыв больше 35 дней хотя бы один раз (клиент должен быть действующим, то есть дата закрытия записи о клиенте не должна быть меньше дня относительно которого мы считаемся).

In [8]:
sql_task_a = '''
                WITH
                    actual_cusomers as
                        (SELECT
                            CLIENT_ID
                        FROM
                            customer_bd
                        WHERE END_DT >= '2023-05-01'),

                    next_transactions as
                        (SELECT
                            CUSTOMER_ID,
                            (strftime('%s', date(lead(TX_DATETIME) over(PARTITION by CUSTOMER_ID))) - strftime('%s', date(TX_DATETIME))) / 86400 as delta_date_transaction

                        FROM
                            transaction_bd)


                SELECT
                    CUSTOMER_ID,
                    max(delta_date_transaction) as MAX_DELTA_BETWEEN_TRANSACTIONS
                FROM
                    next_transactions
                WHERE CUSTOMER_ID in actual_cusomers
                GROUP by CUSTOMER_ID
                HAVING MAX_DELTA_BETWEEN_TRANSACTIONS > 35
                '''
data = pd.read_sql(sql_task_a, connection)
data

    CUSTOMER_ID  MAX_DELTA_BETWEEN_TRANSACTIONS
0            24                              40
1           480                              54
2           812                              83
3           896                              50
4          1129                              42
5          1299                              66
6          1334                              56
7          1459                              45
8          1637                              36
9          1923                              56
10         2061                              58
11         2093                              49
12         2105                              55
13         2201                              43
14         2284                              42
15         2307                              37
16         2368                              39
17         2374                              52
18         3216                              37
19         3352                              41
20         3403                              45
21         3418                              45
22         3478                              42
23         3608                              46
24         3645                              41
25         3990                              44
26         4224                              42
27         4388                              41
28         4562                              64
29         4618                              49
30         4650                              50
31         4875                              50

- b. Вывести список клиентов, у которых максимальная сумма транзакции (имеется ввиду максимальное значение TX_AMOUNT) больше 50000. В ответе должен быть id клиента, максимальное значение суммы транзакций, минимальное значение суммы транзакций (клиент должен быть действующим, то есть дата закрытия записи о клиенте не должна быть меньше дня относительно которого мы считаемся).

In [41]:
sql_task_b = '''
                WITH
                    actual_cusomers as
                        (SELECT
                            CLIENT_ID
                        FROM
                            customer_bd
                        WHERE END_DT >= '2023-05-01'),

                    agregate_tx_amount as
                        (SELECT
                            CUSTOMER_ID,
                            max(TX_AMOUNT) over (PARTITION by CUSTOMER_ID) as MAX_TX_AMOUNT,
                            min(TX_AMOUNT) over (PARTITION by CUSTOMER_ID) as MIN_TX_AMOUNT
                        FROM
                            transaction_bd
                        WHERE CUSTOMER_ID in actual_cusomers)

                SELECT
                    *
                FROM
                    agregate_tx_amount
                GROUP by CUSTOMER_ID
                HAVING MAX_TX_AMOUNT > 50000
                '''
data = pd.read_sql(sql_task_b, connection)
data

   CUSTOMER_ID  MAX_TX_AMOUNT  MIN_TX_AMOUNT
0         3013       77212.50           1.46
1         3494       53213.00          85.76
2         4253       51937.25          37.95

In [74]:
df_actual = df[df['END_DT'] >= '2023-05-01']
df_actual.head(3)

,TRANSACTION_ID,TX_DATETIME,CUSTOMER_ID,TERMINAL_ID,TX_AMOUNT,START_DT,END_DT,CLIENT_NAME,YEAR_BIRTH,CLIENT_ID
424,1,2023-01-01 00:02:10,4961,3412,808.56,2010-09-30,2261-12-31,Alivia,1954,4961
425,537,2023-01-01 03:51:38,4961,6658,559.58,2010-09-30,2261-12-31,Alivia,1954,4961
426,1996,2023-01-01 07:42:16,4961,9415,663.98,2010-09-30,2261-12-31,Alivia,1954,4961

In [83]:
df_result = df_actual.groupby('CUSTOMER_ID', as_index=False)['TX_AMOUNT'].agg(['max', 'min'])
df_result.head(3)

                  max    min
CUSTOMER_ID
0             1258.86  12.62
1            17152.00   5.34
2             1720.11   5.77

In [84]:
df_result[df_result['max'] > 50000]

                  max    min
CUSTOMER_ID
3013         77212.50   1.46
3494         53213.00  85.76
4253         51937.25  37.95

- c. Вывести топ-10 клиентов (сортируя их по убыванию id), у которых сумма дневных транзакций больше суммы вечерних транзакций Условимся, что дневными считаются транзакции, которые были произведены до 12 часов, а вечерними - после 12 часов включительно. (клиент должен быть действующим, то есть дата закрытия записи о клиенте не должна быть меньше дня относительно которого мы считаемся).

- d. Найти для каждого клиента день, когда у него была максимальная сумма транзакции, то есть вывести клиента, дату транзакции, сумму транзакции (клиент должен быть действующим, то есть дата закрытия записи о клиенте не должна быть меньше дня относительно которого мы считаемся).

- e. Вычислить интегральное распределение суммы транзакций для каждого дня за весь период, то есть вывести дату транзакции, сумму транзакции и интегральное распределение по сумме (не учитываем что клиент может быть недействующим)

In [42]:
connection.close()